<?php get_header(); ?>
<?php
/* 
Template Name: フロントページ
*/
?>
<div class="ly_fv">
    <img class="el_fv_img-pc" src="<?php bloginfo(
        "template_url"
    ); ?>/img/fv-pc.jpg" alt="ファーストビュー" />
    <img class="el_fv_img-tb" src="<?php bloginfo(
        "template_url"
    ); ?>/img/fv-tb.jpg" alt="ファーストビュー" />
    <img class="el_fv_img-sp" src="<?php bloginfo(
        "template_url"
    ); ?>/img/fv-sp.jpg" alt="ファーストビュー" />
    <div class="el_icon_wrapper hp_flex">
        <div class="el_icon">
            <a href="https://www.instagram.com/simpleyoga_yuki/" target="_blank" rel="noopener noreferrer"><svg
                    width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd"
                        d="M7.465 1.066C8.638 1.012 9.012 1 12 1C14.988 1 15.362 1.013 16.534 1.066C17.706 1.119 18.506 1.306 19.206 1.577C19.939 1.854 20.604 2.287 21.154 2.847C21.714 3.396 22.146 4.06 22.422 4.794C22.694 5.494 22.88 6.294 22.934 7.464C22.988 8.639 23 9.013 23 12C23 14.988 22.987 15.362 22.934 16.535C22.881 17.705 22.694 18.505 22.422 19.205C22.146 19.9391 21.7133 20.6042 21.154 21.154C20.604 21.714 19.939 22.146 19.206 22.422C18.506 22.694 17.706 22.88 16.536 22.934C15.362 22.988 14.988 23 12 23C9.012 23 8.638 22.987 7.465 22.934C6.295 22.881 5.495 22.694 4.795 22.422C4.06092 22.146 3.39582 21.7133 2.846 21.154C2.28638 20.6047 1.85331 19.9399 1.577 19.206C1.306 18.506 1.12 17.706 1.066 16.536C1.012 15.361 1 14.987 1 12C1 9.012 1.013 8.638 1.066 7.466C1.119 6.294 1.306 5.494 1.577 4.794C1.85372 4.06008 2.28712 3.39531 2.847 2.846C3.39604 2.2865 4.06047 1.85344 4.794 1.577C5.494 1.306 6.294 1.12 7.464 1.066H7.465ZM16.445 3.046C15.285 2.993 14.937 2.982 12 2.982C9.063 2.982 8.715 2.993 7.555 3.046C6.482 3.095 5.9 3.274 5.512 3.425C4.999 3.625 4.632 3.862 4.247 4.247C3.88205 4.60205 3.60118 5.03428 3.425 5.512C3.274 5.9 3.095 6.482 3.046 7.555C2.993 8.715 2.982 9.063 2.982 12C2.982 14.937 2.993 15.285 3.046 16.445C3.095 17.518 3.274 18.1 3.425 18.488C3.601 18.965 3.882 19.398 4.247 19.753C4.602 20.118 5.035 20.399 5.512 20.575C5.9 20.726 6.482 20.905 7.555 20.954C8.715 21.007 9.062 21.018 12 21.018C14.938 21.018 15.285 21.007 16.445 20.954C17.518 20.905 18.1 20.726 18.488 20.575C19.001 20.375 19.368 20.138 19.753 19.753C20.118 19.398 20.399 18.965 20.575 18.488C20.726 18.1 20.905 17.518 20.954 16.445C21.007 15.285 21.018 14.937 21.018 12C21.018 9.063 21.007 8.715 20.954 7.555C20.905 6.482 20.726 5.9 20.575 5.512C20.375 4.999 20.138 4.632 19.753 4.247C19.3979 3.88207 18.9657 3.60121 18.488 3.425C18.1 3.274 17.518 3.095 16.445 3.046ZM10.595 15.391C11.3797 15.7176 12.2534 15.7617 13.0669 15.5157C13.8805 15.2697 14.5834 14.7489 15.0556 14.0422C15.5278 13.3356 15.7401 12.4869 15.656 11.6411C15.572 10.7953 15.197 10.005 14.595 9.405C14.2112 9.02148 13.7472 8.72781 13.2363 8.54515C12.7255 8.36248 12.1804 8.29536 11.6405 8.34862C11.1006 8.40187 10.5792 8.57418 10.1138 8.85313C9.64845 9.13208 9.25074 9.51074 8.9493 9.96185C8.64786 10.413 8.45019 10.9253 8.37052 11.462C8.29084 11.9986 8.33115 12.5463 8.48854 13.0655C8.64593 13.5847 8.91648 14.0626 9.28072 14.4647C9.64496 14.8668 10.0938 15.1832 10.595 15.391ZM8.002 8.002C8.52702 7.47697 9.15032 7.0605 9.8363 6.77636C10.5223 6.49222 11.2575 6.34597 12 6.34597C12.7425 6.34597 13.4777 6.49222 14.1637 6.77636C14.8497 7.0605 15.473 7.47697 15.998 8.002C16.523 8.52702 16.9395 9.15032 17.2236 9.8363C17.5078 10.5223 17.654 11.2575 17.654 12C17.654 12.7425 17.5078 13.4777 17.2236 14.1637C16.9395 14.8497 16.523 15.473 15.998 15.998C14.9377 17.0583 13.4995 17.654 12 17.654C10.5005 17.654 9.06234 17.0583 8.002 15.998C6.94166 14.9377 6.34597 13.4995 6.34597 12C6.34597 10.5005 6.94166 9.06234 8.002 8.002ZM18.908 7.188C19.0381 7.06527 19.1423 6.91768 19.2143 6.75397C19.2863 6.59027 19.3248 6.41377 19.3274 6.23493C19.33 6.05609 19.2967 5.87855 19.2295 5.71281C19.1622 5.54707 19.0624 5.39651 18.936 5.27004C18.8095 5.14357 18.6589 5.04376 18.4932 4.97652C18.3275 4.90928 18.1499 4.87598 17.9711 4.87858C17.7922 4.88119 17.6157 4.91965 17.452 4.9917C17.2883 5.06374 17.1407 5.1679 17.018 5.298C16.7793 5.55103 16.6486 5.88712 16.6537 6.23493C16.6588 6.58274 16.7992 6.91488 17.0452 7.16084C17.2911 7.40681 17.6233 7.54723 17.9711 7.5523C18.3189 7.55737 18.655 7.42669 18.908 7.188Z"
                        fill="#AE7D45" />
                </svg>
            </a>
        </div>
        <!-- <div class="el_icon">
            <a href="https://www.instagram.com/simpleyoga_yuki/" target="_blank" rel="noopener noreferrer"><svg
                    width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_702_1430)">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                            d="M0 12.067C0 18.033 4.333 22.994 10 24V15.333H7V12H10V9.333C10 6.333 11.933 4.667 14.667 4.667C15.533 4.667 16.467 4.8 17.333 4.933V8H15.8C14.333 8 14 8.733 14 9.667V12H17.2L16.667 15.333H14V24C19.667 22.994 24 18.034 24 12.067C24 5.43 18.6 0 12 0C5.4 0 0 5.43 0 12.067Z"
                            fill="#AE7D45" />
                    </g>
                    <defs>
                        <clipPath id="clip0_702_1430">
                            <rect width="24" height="24" fill="white" />
                        </clipPath>
                    </defs>
                </svg>

            </a>
        </div>
        <div class="el_icon">
            <a href="https://www.instagram.com/simpleyoga_yuki/" target="_blank" rel="noopener noreferrer"><svg
                    width="24" height="23" viewBox="0 0 24 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M12 0C18.6165 0 24 4.368 24 9.738C24 11.8875 23.1675 13.8225 21.4275 15.729C18.9105 18.627 13.281 22.1565 12 22.6965C10.755 23.2215 10.899 22.401 10.956 22.077L10.9605 22.05L11.1315 21.0225C11.172 20.7165 11.214 20.241 11.0925 19.938C10.9575 19.6035 10.4265 19.4295 10.0365 19.3455C4.269 18.585 0 14.5515 0 9.738C0 4.368 5.385 0 12 0ZM7.533 11.529H5.2455V7.377C5.2455 7.3152 5.22105 7.25591 5.17749 7.21207C5.13393 7.16822 5.0748 7.1434 5.013 7.143H4.17C4.13927 7.143 4.10884 7.14905 4.08045 7.16081C4.05206 7.17257 4.02627 7.18981 4.00454 7.21154C3.98281 7.23327 3.96557 7.25906 3.95381 7.28745C3.94205 7.31584 3.936 7.34627 3.936 7.377V12.606C3.936 12.6675 3.9615 12.726 4.002 12.7665V12.768L4.005 12.771L4.008 12.774C4.0515 12.8158 4.10965 12.839 4.17 12.8385H7.533C7.662 12.8385 7.7655 12.7335 7.7655 12.6045V11.7645C7.7657 11.7338 7.75984 11.7033 7.74826 11.6748C7.73669 11.6464 7.71961 11.6205 7.69802 11.5986C7.67644 11.5767 7.65075 11.5593 7.62243 11.5474C7.59412 11.5354 7.56373 11.5292 7.533 11.529ZM8.7195 7.143C8.65744 7.143 8.59792 7.16765 8.55404 7.21154C8.51015 7.25542 8.4855 7.31494 8.4855 7.377V12.606C8.4855 12.735 8.5905 12.8385 8.7195 12.8385H9.5625C9.6915 12.8385 9.795 12.7335 9.795 12.606V7.377C9.795 7.3152 9.77055 7.25591 9.72699 7.21207C9.68343 7.16822 9.6243 7.1434 9.5625 7.143H8.7195ZM14.514 7.143C14.4519 7.143 14.3924 7.16765 14.3485 7.21154C14.3047 7.25542 14.28 7.31494 14.28 7.377V10.482L11.8845 7.248C11.8784 7.24013 11.8719 7.23261 11.865 7.2255V7.224C11.8603 7.21875 11.8553 7.21374 11.85 7.209L11.8455 7.2045C11.8404 7.19958 11.8348 7.19507 11.829 7.191H11.8275L11.82 7.185L11.8155 7.182C11.8132 7.18025 11.8106 7.17874 11.808 7.1775L11.796 7.17H11.793L11.7885 7.167L11.7735 7.161L11.7675 7.158C11.7626 7.15622 11.7576 7.15472 11.7525 7.1535H11.7495L11.745 7.152L11.7315 7.149H11.7225L11.718 7.1475H11.712L11.709 7.146H10.848C10.7862 7.146 10.7269 7.17045 10.6831 7.21401C10.6392 7.25757 10.6144 7.3167 10.614 7.3785V12.6075C10.614 12.7365 10.719 12.84 10.848 12.84H11.688C11.8185 12.84 11.9235 12.735 11.9235 12.6075V9.5025L14.3235 12.7425C14.3395 12.7648 14.3593 12.7841 14.382 12.7995L14.3835 12.801L14.3985 12.81L14.4045 12.813C14.4084 12.8153 14.4124 12.8173 14.4165 12.819L14.427 12.8235L14.4345 12.8265C14.4395 12.8282 14.4445 12.8297 14.4495 12.831H14.454C14.4735 12.8366 14.4937 12.8396 14.514 12.84H15.354C15.4845 12.84 15.5895 12.735 15.5895 12.6075V7.377C15.5895 7.31494 15.5648 7.25542 15.521 7.21154C15.4771 7.16765 15.4176 7.143 15.3555 7.143H14.514ZM20.2365 8.2185V7.3785C20.2367 7.34777 20.2308 7.3173 20.2193 7.28884C20.2077 7.26037 20.1906 7.23446 20.169 7.2126C20.1474 7.19073 20.1217 7.17333 20.0934 7.16139C20.0651 7.14944 20.0347 7.1432 20.004 7.143H16.641C16.5805 7.14307 16.5223 7.16675 16.479 7.209H16.4775L16.476 7.212L16.473 7.2165C16.4311 7.25948 16.4075 7.31699 16.407 7.377V12.606C16.407 12.6675 16.4325 12.726 16.473 12.7665L16.476 12.771L16.479 12.774C16.5226 12.8157 16.5807 12.8388 16.641 12.8385H20.004C20.133 12.8385 20.2365 12.7335 20.2365 12.6045V11.7645C20.2367 11.7338 20.2308 11.7033 20.2193 11.6748C20.2077 11.6464 20.1906 11.6205 20.169 11.5986C20.1474 11.5767 20.1217 11.5593 20.0934 11.5474C20.0651 11.5354 20.0347 11.5292 20.004 11.529H17.715V10.6455H20.0025C20.1315 10.6455 20.235 10.5405 20.235 10.4115V9.5715C20.2352 9.54077 20.2293 9.5103 20.2178 9.48184C20.2062 9.45337 20.1891 9.42746 20.1675 9.4056C20.1459 9.38373 20.1202 9.36633 20.0919 9.35439C20.0636 9.34244 20.0332 9.3362 20.0025 9.336H17.715V8.4525H20.0025C20.1315 8.4525 20.235 8.3475 20.235 8.2185H20.2365Z"
                        fill="#AE7D45" />
                </svg>

            </a>
        </div> -->
    </div>
    <div class="bl_fv_copy">
        <div class="bl_fv_copy_main01">私<span>を</span>変えてくれた
        </div>
        <div class="bl_fv_copy_main02">二つ<span>の</span>魔法<span>を</span>
        </div>
        <div class="bl_fv_copy_main03">あなた<span>に。</span>
        </div>
    </div>
</div>
<section class="ly_section hp_ptLg hp_pbLg hp_bgColor" id="tategaki">
    <div class="ly_inner">
        <div class="bl_intro-pc hp_pc">
            <p>美味しいものを食べると<br>
                笑顔になって、ご機嫌になって</p>
            <p>そこに会話が弾んで<br>人と人との繋がりが深まる。</p>
            <p>そうやって生活の土台が安定してくると<br>暮らしが豊かになったり</p>
            <p>新しいことにチャレンジしたり<br>前向きになれたり。</p>
            <p>そんな風に少しずつでも<br>「
                魔法の米粉シフォンケーキ®︎」
                と、<br>「
                ヨガ」を通じて</p>
            <p>幸せの輪を広げていけたらいいな<br>と思っています。
            </p>
            <!-- <div class="owner">
                <p>主宰 ユキ</p>
            </div> -->
        </div>
        <div class="bl_intro-sp hp_sp">
            <p class="p-1">美味しいものを食べると<br>
                笑顔になって、ご機嫌になって</p>
            <p class="p-2">そこに会話が弾んで<br>人と人との繋がりが深まる。</p>
            <p class="p-3">そうやって生活の土台が<br class="hp_br-sp">安定してくると<br>暮らしが豊かになったり</p>
            <p class="p-4">新しいことにチャレンジしたり<br>前向きになれたり。</p>
            <p class="p-5">そんな風に少しずつでも<br>「
                魔法の米粉シフォンケーキ®︎」
                と、<br>「
                ヨガ」を通じて</p>
            <p class="p-6">幸せの輪を広げていけたらいいな<br>と思っています。
            </p>
        </div>
    </div>
</section>
<section class="ly_section hp_ptLg" id="intro">
    <div class="ly_inner">
        <span class="el_section_ttl_sub">はじめに</span>
        <h2 class="el_section_ttl">Intro</h2>
        <div class="bl_section hp_flex hp_ptSm hp_column_tb">
            <figure class="bl_section_imgWrapper">
                <img src="<?php bloginfo(
                    "template_url"
                ); ?>/img/profile00.png" data-aos="fade-up" alt="プロフィール写真" />
            </figure>
            <div class="bl_section_body">
                <p class="bl_section_txt hp_mbSm">
                    はじめまして。<br>
                    -Simple yoga-を主宰するYuKIと申します。<br>
                    <br>
                    私のヨガと魔法の米粉シフォンケーキ®︎を通して伝えたい想いを感じていただけると幸いです。<br>
                </p>
                <a href="<?php bloginfo(
                "url"
                ); ?>/intro" class="el_btn">
                    <div class="arrow"></div>
                    <p>はじめに</p>
                </a>
            </div>
        </div>
    </div>
</section>
<section class="ly_section hp_ptLg" id="cake">
    <div class="ly_inner">
        <!-- <h2 class="el_section_ttl">For Beginner</h2>
        <span class="el_section_ttl_sub hp_mbSm">初めての方へ</span> -->
        <div class="bl_section hp_flex hp_ptSm hp_reverse hp_column_tb">
            <figure class="bl_section_imgWrapper pc">
                <img src="<?php bloginfo(
                    "template_url"
                ); ?>/img/cake00.png" data-aos="fade-up" alt="シフォンケーキの俯瞰写真" />
            </figure>
            <div class="bl_section_body">
                <span class="bl_section_header_sub">魔法の米粉シフォンケーキ<div class="font">
                        ®︎
                    </div></span>
                <h3 class="bl_section_header hp_mb30">
                    Cake
                </h3>
                <figure class="bl_section_imgWrapper tb">
                    <img src="<?php bloginfo(
                    "template_url"
                ); ?>/img/cake00.png" data-aos="fade-up" alt="シフォンケーキの俯瞰写真" />
                </figure>
                <p class="bl_section_txt">
                    「体に優しく、シフォンケーキの新しい美味しさ」を軸に、私の体感や経験を基に5年以上かけ研究した独自レシピ。
                </p>
                <a href="<?php bloginfo(
                "url"
                ); ?>/cake" class="el_btn">
                    <div class="arrow"></div>
                    <p>魔法の米粉シフォンケーキ®︎</p>
                </a>
            </div>
        </div>
    </div>
</section>
<section class="ly_section hp_ptLg hp_pbLg" id="yoga">
    <div class="ly_inner">
        <div class="bl_section hp_flex hp_ptSm hp_column_tb">
            <figure class="bl_section_imgWrapper pc">
                <img src="<?php bloginfo(
                    "template_url"
                ); ?>/img/yoga00.png" data-aos="fade-up" alt="ヨガの風景" />
            </figure>
            <div class="bl_section_body">
                <span class="bl_section_header_sub">小さな隠れ家ヨガサロン</span>
                <h3 class="bl_section_header hp_mb30">
                    Yoga
                </h3>
                <figure class="bl_section_imgWrapper tb">
                    <img src="<?php bloginfo(
                    "template_url"
                ); ?>/img/yoga00.png" data-aos="fade-up" alt="ヨガの風景" />
                </figure>
                <p class="bl_section_txt">
                    無垢の床とグリーンに囲まれた空間で、自然の温もりを感じながら呼吸と共にゆったりと身体を動かしていきます。
                </p>
                <a href="<?php bloginfo(
                "url"
                ); ?>/yoga" class="el_btn">
                    <div class="arrow"></div>
                    <p>小さな隠れ家ヨガサロン</p>
                </a>
            </div>
        </div>
    </div>
</section>
<section class="ly_section hp_ptLg hp_pbLg hp_bgColor" id="insta">
    <div class="ly_inner">
        <span class="el_section_ttl_sub">日々の活動</span>
        <h2 class="el_section_ttl">Instagram</h2>
        <div class="bl_section hp_ptSm">
            <?php echo do_shortcode('[instagram-feed feed=1]'); ?>
        </div>
        <!-- <a href="<?php bloginfo(
                "url"
                ); ?>/beginner" class="el_btn hp_centering">
            <div class="arrow"></div>
            <p>日々の活動</p>
        </a> -->
    </div>
</section>
<section class="ly_section hp_ptLg hp_pbLg" id="reserve">
    <div class="ly_inner">
        <span class="el_section_ttl_sub">ご予約はこちら</span>
        <h2 class="el_section_ttl">Reserve</h2>
        <div class="bl_section hp_flex hp_jcc">
            <p class="bl_section_txt hp_mbMd hp_mtMd">
                魔法の米粉シフォンケーキ®︎及び、ヨガは完全予約制です。<br>
                各ご予約ページで承っております。
            </p>
        </div>
        <div class="hp_flex hp_column">
            <a href="<?php bloginfo(
                    "url"
                    ); ?>/reserve_cake" class="el_btn hp_centering hp_mb30">
                <div class="arrow"></div>
                <p>魔法の米粉シフォンケーキ®︎<br class="hp_br-sp">の対面レッスンのご予約はこちら</p>
            </a>
            <a href="<?php bloginfo(
                    "url"
                    ); ?>/reserve_cake" class="el_btn hp_centering hp_mb30">
                <div class="arrow"></div>
                <p>魔法の米粉シフォンケーキ®︎<br class="hp_br-sp">のオンラインレッスンのご予約はこちら</p>
            </a>
            <a href="<?php bloginfo(
                    "url"
                    ); ?>/reserve_yoga" class="el_btn hp_centering">
                <div class="arrow"></div>
                <p>ヨガのご予約はこちら</p>
            </a>
        </div>
    </div>
</section>

<?php get_footer(); ?>